apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#if !defined(CONFIG_LPUART12_TXDMA)
#  define LPUART12_TXBUFSIZE_ADJUSTED  CONFIG_LPUART12_TXBUFSIZE
#  define LPUART12_TXBUFSIZE_ALGN
#else
#  define LPUART12_TXBUFSIZE_ADJUSTED TXDMA_BUF_SIZE(CONFIG_LPUART12_TXBUFSIZE)
#  define LPUART12_TXBUFSIZE_ALGN TXDMA_BUF_ALIGN
#endif

#if !defined(CONFIG_LPUART13_TXDMA)
#  define LPUART13_TXBUFSIZE_ADJUSTED  CONFIG_LPUART13_TXBUFSIZE
#  define LPUART13_TXBUFSIZE_ALGN
#else
#  define LPUART13_TXBUFSIZE_ADJUSTED TXDMA_BUF_SIZE(CONFIG_LPUART13_TXBUFSIZE)
#  define LPUART13_TXBUFSIZE_ALGN TXDMA_BUF_ALIGN
#endif

#if !defined(CONFIG_LPUART14_TXDMA)
#  define LPUART14_TXBUFSIZE_ADJUSTED  CONFIG_LPUART14_TXBUFSIZE
#  define LPUART14_TXBUFSIZE_ALGN
#else
#  define LPUART14_TXBUFSIZE_ADJUSTED TXDMA_BUF_SIZE(CONFIG_LPUART14_TXBUFSIZE)
#  define LPUART14_TXBUFSIZE_ALGN TXDMA_BUF_ALIGN
#endif

#if !defined(CONFIG_LPUART15_TXDMA)
#  define LPUART15_TXBUFSIZE_ADJUSTED  CONFIG_LPUART15_TXBUFSIZE
#  define LPUART15_TXBUFSIZE_ALGN
#else
#  define LPUART15_TXBUFSIZE_ADJUSTED TXDMA_BUF_SIZE(CONFIG_LPUART15_TXBUFSIZE)
#  define LPUART15_TXBUFSIZE_ALGN TXDMA_BUF_ALIGN
#endif

/* Which LPUART with be tty0/console and which tty0-15?  The console will
 * always be ttyS0.  If there is no console then will use the lowest
 * numbered LPUART.
 */

/* First pick the console and ttys0.  This could be any of LPUART0-2 */

#if defined(CONFIG_LPUART0_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart0priv /* LPUART0 is console */
#  define TTYS0_DEV           g_lpuart0priv /* LPUART0 is ttyS0 */
#  define LPUART0_ASSIGNED    1
#  if defined(CONFIG_LPUART0_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART0_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART1_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart1priv /* LPUART1 is console */
#  define TTYS0_DEV           g_lpuart1priv /* LPUART1 is ttyS0 */
#  define LPUART1_ASSIGNED    1
#  if defined(CONFIG_LPUART1_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART1_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART2_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart2priv /* LPUART2 is console */
#  define TTYS0_DEV           g_lpuart2priv /* LPUART2 is ttyS0 */
#  define LPUART2_ASSIGNED    1
#  if defined(CONFIG_LPUART2_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART2_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART3_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart3priv /* LPUART3 is console */
#  define TTYS0_DEV           g_lpuart3priv /* LPUART3 is ttyS0 */
#  define LPUART3_ASSIGNED    1
#  if defined(CONFIG_LPUART3_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART3_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART4_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart4priv /* LPUART4 is console */
#  define TTYS0_DEV           g_lpuart4priv /* LPUART4 is ttyS0 */
#  define LPUART4_ASSIGNED    1
#  if defined(CONFIG_LPUART4_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART4_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART5_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart5priv /* LPUART5 is console */
#  define TTYS0_DEV           g_lpuart5priv /* LPUART5 is ttyS0 */
#  define LPUART5_ASSIGNED    1
#  if defined(CONFIG_LPUART5_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART5_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART6_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart6priv /* LPUART6 is console */
#  define TTYS0_DEV           g_lpuart6priv /* LPUART6 is ttyS0 */
#  define LPUART6_ASSIGNED    1
#  if defined(CONFIG_LPUART6_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART6_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART7_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart7priv /* LPUART7 is console */
#  define TTYS0_DEV           g_lpuart7priv /* LPUART7 is ttyS0 */
#  define LPUART7_ASSIGNED    1
#  if defined(CONFIG_LPUART7_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART7_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART8_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart8priv /* LPUART8 is console */
#  define TTYS0_DEV           g_lpuart8priv /* LPUART8 is ttyS0 */
#  define LPUART8_ASSIGNED    1
#  if defined(CONFIG_LPUART8_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART8_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART9_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart9priv /* LPUART9 is console */
#  define TTYS0_DEV           g_lpuart9priv /* LPUART9 is ttyS0 */
#  define LPUART9_ASSIGNED    1
#  if defined(CONFIG_LPUART9_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART9_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART10_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart10priv /* LPUART10 is console */
#  define TTYS0_DEV           g_lpuart10priv /* LPUART10 is ttyS0 */
#  define LPUART10_ASSIGNED   1
#  if defined(CONFIG_LPUART10_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART10_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART11_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart11priv /* LPUART11 is console */
#  define TTYS0_DEV           g_lpuart11priv /* LPUART11 is ttyS0 */
#  define LPUART11_ASSIGNED   1
#  if defined(CONFIG_LPUART11_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART11_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART12_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart12priv /* LPUART12 is console */
#  define TTYS0_DEV           g_lpuart12priv /* LPUART12 is ttyS0 */
#  define LPUART12_ASSIGNED   1
#  if defined(CONFIG_LPUART12_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART12_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART13_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart13priv /* LPUART13 is console */
#  define TTYS0_DEV           g_lpuart13priv /* LPUART13 is ttyS0 */
#  define LPUART13_ASSIGNED   1
#  if defined(CONFIG_LPUART13_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART13_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART14_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart14priv /* LPUART14 is console */
#  define TTYS0_DEV           g_lpuart14priv /* LPUART14 is ttyS0 */
#  define LPUART14_ASSIGNED   1
#  if defined(CONFIG_LPUART14_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART14_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#elif defined(CONFIG_LPUART15_SERIAL_CONSOLE)
#  define CONSOLE_DEV         g_lpuart15priv /* LPUART15 is console */
#  define TTYS0_DEV           g_lpuart15priv /* LPUART15 is ttyS0 */
#  define LPUART15_ASSIGNED   1
#  if defined(CONFIG_LPUART15_RXDMA)
#    define SERIAL_HAVE_CONSOLE_RXDMA 1
#  endif
#  if defined(CONFIG_LPUART15_TXDMA)
#    define SERIAL_HAVE_CONSOLE_TXDMA 1
#  endif
#else
#  undef CONSOLE_DEV                      /* No console */
#  if defined(CONFIG_S32K3XX_LPUART0)
#    define TTYS0_DEV         g_lpuart0priv /* LPUART0 is ttyS0 */
#    define LPUART0_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART1)
#    define TTYS0_DEV         g_lpuart1priv /* LPUART1 is ttyS0 */
#    define LPUART1_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART2)
#    define TTYS0_DEV         g_lpuart2priv /* LPUART2 is ttyS0 */
#    define LPUART2_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART3)
#    define TTYS0_DEV         g_lpuart3priv /* LPUART3 is ttyS0 */
#    define LPUART3_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART4)
#    define TTYS0_DEV         g_lpuart4priv /* LPUART4 is ttyS0 */
#    define LPUART4_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART5)
#    define TTYS0_DEV         g_lpuart5priv /* LPUART5 is ttyS0 */
#    define LPUART5_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART6)
#    define TTYS0_DEV         g_lpuart6priv /* LPUART6 is ttyS0 */
#    define LPUART6_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART7)
#    define TTYS0_DEV         g_lpuart7priv /* LPUART7 is ttyS0 */
#    define LPUART7_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART8)
#    define TTYS0_DEV         g_lpuart8priv /* LPUART8 is ttyS0 */
#    define LPUART8_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART9)
#    define TTYS0_DEV         g_lpuart9priv /* LPUART9 is ttyS0 */
#    define LPUART9_ASSIGNED  1
#  elif defined(CONFIG_S32K3XX_LPUART10)
#    define TTYS0_DEV         g_lpuart10priv /* LPUART10 is ttyS0 */
#    define LPUART10_ASSIGNED 1
#  elif defined(CONFIG_S32K3XX_LPUART11)
#    define TTYS0_DEV         g_lpuart11priv /* LPUART11 is ttyS0 */
#    define LPUART11_ASSIGNED 1
#  elif defined(CONFIG_S32K3XX_LPUART12)
#    define TTYS0_DEV         g_lpuart12priv /* LPUART12 is ttyS0 */
#    define LPUART12_ASSIGNED 1
#  elif defined(CONFIG_S32K3XX_LPUART13)
#    define TTYS0_DEV         g_lpuart13priv /* LPUART13 is ttyS0 */
#    define LPUART13_ASSIGNED 1
#  elif defined(CONFIG_S32K3XX_LPUART14)
#    define TTYS0_DEV         g_lpuart14priv /* LPUART14 is ttyS0 */
#    define LPUART14_ASSIGNED 1
#  elif defined(CONFIG_S32K3XX_LPUART15)
#    define TTYS0_DEV         g_lpuart15priv /* LPUART15 is ttyS0 */
#    define LPUART15_ASSIGNED 1
#  endif
#endif

