apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#if defined(SERIAL_HAVE_CONSOLE_RXDMA) || defined(SERIAL_HAVE_CONSOLE_TXDMA)
#  define SERIAL_HAVE_CONSOLE_DMA
#endif

/* Pick ttys1.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS1_DEV           g_lpuart0priv /* LPUART0 is ttyS1 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS1_DEV           g_lpuart1priv /* LPUART1 is ttyS1 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS1_DEV           g_lpuart2priv /* LPUART2 is ttyS1 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS1_DEV           g_lpuart3priv /* LPUART3 is ttyS1 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS1_DEV           g_lpuart4priv /* LPUART4 is ttyS1 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS1_DEV           g_lpuart5priv /* LPUART5 is ttyS1 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS1_DEV           g_lpuart6priv /* LPUART6 is ttyS1 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS1_DEV           g_lpuart7priv /* LPUART7 is ttyS1 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS1_DEV           g_lpuart8priv /* LPUART8 is ttyS1 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS1_DEV           g_lpuart9priv /* LPUART9 is ttyS1 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS1_DEV           g_lpuart10priv /* LPUART10 is ttyS1 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS1_DEV           g_lpuart11priv /* LPUART11 is ttyS1 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS1_DEV           g_lpuart12priv /* LPUART12 is ttyS1 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS1_DEV           g_lpuart13priv /* LPUART13 is ttyS1 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS1_DEV           g_lpuart14priv /* LPUART14 is ttyS1 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS1_DEV           g_lpuart15priv /* LPUART15 is ttyS1 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys2.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS2_DEV           g_lpuart0priv /* LPUART0 is ttyS2 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS2_DEV           g_lpuart1priv /* LPUART1 is ttyS2 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS2_DEV           g_lpuart2priv /* LPUART2 is ttyS2 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS2_DEV           g_lpuart3priv /* LPUART3 is ttyS2 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS2_DEV           g_lpuart4priv /* LPUART4 is ttyS2 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS2_DEV           g_lpuart5priv /* LPUART5 is ttyS2 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS2_DEV           g_lpuart6priv /* LPUART6 is ttyS2 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS2_DEV           g_lpuart7priv /* LPUART7 is ttyS2 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS2_DEV           g_lpuart8priv /* LPUART8 is ttyS2 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS2_DEV           g_lpuart9priv /* LPUART9 is ttyS2 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS2_DEV           g_lpuart10priv /* LPUART10 is ttyS2 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS2_DEV           g_lpuart11priv /* LPUART11 is ttyS2 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS2_DEV           g_lpuart12priv /* LPUART12 is ttyS2 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS2_DEV           g_lpuart13priv /* LPUART13 is ttyS2 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS2_DEV           g_lpuart14priv /* LPUART14 is ttyS2 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS2_DEV           g_lpuart15priv /* LPUART15 is ttyS2 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys3.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS3_DEV           g_lpuart0priv /* LPUART0 is ttyS3 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS3_DEV           g_lpuart1priv /* LPUART1 is ttyS3 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS3_DEV           g_lpuart2priv /* LPUART2 is ttyS3 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS3_DEV           g_lpuart3priv /* LPUART3 is ttyS3 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS3_DEV           g_lpuart4priv /* LPUART4 is ttyS3 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS3_DEV           g_lpuart5priv /* LPUART5 is ttyS3 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS3_DEV           g_lpuart6priv /* LPUART6 is ttyS3 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS3_DEV           g_lpuart7priv /* LPUART7 is ttyS3 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS3_DEV           g_lpuart8priv /* LPUART8 is ttyS3 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS3_DEV           g_lpuart9priv /* LPUART9 is ttyS3 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS3_DEV           g_lpuart10priv /* LPUART10 is ttyS3 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS3_DEV           g_lpuart11priv /* LPUART11 is ttyS3 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS3_DEV           g_lpuart12priv /* LPUART12 is ttyS3 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS3_DEV           g_lpuart13priv /* LPUART13 is ttyS3 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS3_DEV           g_lpuart14priv /* LPUART14 is ttyS3 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS3_DEV           g_lpuart15priv /* LPUART15 is ttyS3 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys4.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS4_DEV           g_lpuart0priv /* LPUART0 is ttyS4 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS4_DEV           g_lpuart1priv /* LPUART1 is ttyS4 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS4_DEV           g_lpuart2priv /* LPUART2 is ttyS4 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS4_DEV           g_lpuart3priv /* LPUART3 is ttyS4 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS4_DEV           g_lpuart4priv /* LPUART4 is ttyS4 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS4_DEV           g_lpuart5priv /* LPUART5 is ttyS4 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS4_DEV           g_lpuart6priv /* LPUART6 is ttyS4 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS4_DEV           g_lpuart7priv /* LPUART7 is ttyS4 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS4_DEV           g_lpuart8priv /* LPUART8 is ttyS4 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS4_DEV           g_lpuart9priv /* LPUART9 is ttyS4 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS4_DEV           g_lpuart10priv /* LPUART10 is ttyS4 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS4_DEV           g_lpuart11priv /* LPUART11 is ttyS4 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS4_DEV           g_lpuart12priv /* LPUART12 is ttyS4 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS4_DEV           g_lpuart13priv /* LPUART13 is ttyS4 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS4_DEV           g_lpuart14priv /* LPUART14 is ttyS4 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS4_DEV           g_lpuart15priv /* LPUART15 is ttyS4 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys5.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS5_DEV           g_lpuart0priv /* LPUART0 is ttyS5 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS5_DEV           g_lpuart1priv /* LPUART1 is ttyS5 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS5_DEV           g_lpuart2priv /* LPUART2 is ttyS5 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS5_DEV           g_lpuart3priv /* LPUART3 is ttyS5 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS5_DEV           g_lpuart4priv /* LPUART4 is ttyS5 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS5_DEV           g_lpuart5priv /* LPUART5 is ttyS5 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS5_DEV           g_lpuart6priv /* LPUART6 is ttyS5 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS5_DEV           g_lpuart7priv /* LPUART7 is ttyS5 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS5_DEV           g_lpuart8priv /* LPUART8 is ttyS5 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS5_DEV           g_lpuart9priv /* LPUART9 is ttyS5 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS5_DEV           g_lpuart10priv /* LPUART10 is ttyS5 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS5_DEV           g_lpuart11priv /* LPUART11 is ttyS5 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS5_DEV           g_lpuart12priv /* LPUART12 is ttyS5 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS5_DEV           g_lpuart13priv /* LPUART13 is ttyS5 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS5_DEV           g_lpuart14priv /* LPUART14 is ttyS5 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS5_DEV           g_lpuart15priv /* LPUART15 is ttyS5 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys6.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS6_DEV           g_lpuart0priv /* LPUART0 is ttyS6 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS6_DEV           g_lpuart1priv /* LPUART1 is ttyS6 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS6_DEV           g_lpuart2priv /* LPUART2 is ttyS6 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS6_DEV           g_lpuart3priv /* LPUART3 is ttyS6 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS6_DEV           g_lpuart4priv /* LPUART4 is ttyS6 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS6_DEV           g_lpuart5priv /* LPUART5 is ttyS6 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS6_DEV           g_lpuart6priv /* LPUART6 is ttyS6 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS6_DEV           g_lpuart7priv /* LPUART7 is ttyS6 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS6_DEV           g_lpuart8priv /* LPUART8 is ttyS6 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS6_DEV           g_lpuart9priv /* LPUART9 is ttyS6 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS6_DEV           g_lpuart10priv /* LPUART10 is ttyS6 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS6_DEV           g_lpuart11priv /* LPUART11 is ttyS6 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS6_DEV           g_lpuart12priv /* LPUART12 is ttyS6 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS6_DEV           g_lpuart13priv /* LPUART13 is ttyS6 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS6_DEV           g_lpuart14priv /* LPUART14 is ttyS6 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS6_DEV           g_lpuart15priv /* LPUART15 is ttyS6 */
#  define LPUART15_ASSIGNED   1
#endif

