apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
/* Pick ttys7.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS7_DEV           g_lpuart0priv /* LPUART0 is ttyS7 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS7_DEV           g_lpuart1priv /* LPUART1 is ttyS7 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS7_DEV           g_lpuart2priv /* LPUART2 is ttyS7 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS7_DEV           g_lpuart3priv /* LPUART3 is ttyS7 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS7_DEV           g_lpuart4priv /* LPUART4 is ttyS7 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS7_DEV           g_lpuart5priv /* LPUART5 is ttyS7 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS7_DEV           g_lpuart6priv /* LPUART6 is ttyS7 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS7_DEV           g_lpuart7priv /* LPUART7 is ttyS7 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS7_DEV           g_lpuart8priv /* LPUART8 is ttyS7 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS7_DEV           g_lpuart9priv /* LPUART9 is ttyS7 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS7_DEV           g_lpuart10priv /* LPUART10 is ttyS7 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS7_DEV           g_lpuart11priv /* LPUART11 is ttyS7 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS7_DEV           g_lpuart12priv /* LPUART12 is ttyS7 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS7_DEV           g_lpuart13priv /* LPUART13 is ttyS7 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS7_DEV           g_lpuart14priv /* LPUART14 is ttyS7 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS7_DEV           g_lpuart15priv /* LPUART15 is ttyS7 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys8.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS8_DEV           g_lpuart0priv /* LPUART0 is ttyS8 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS8_DEV           g_lpuart1priv /* LPUART1 is ttyS8 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS8_DEV           g_lpuart2priv /* LPUART2 is ttyS8 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS8_DEV           g_lpuart3priv /* LPUART3 is ttyS8 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS8_DEV           g_lpuart4priv /* LPUART4 is ttyS8 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS8_DEV           g_lpuart5priv /* LPUART5 is ttyS8 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS8_DEV           g_lpuart6priv /* LPUART6 is ttyS8 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS8_DEV           g_lpuart7priv /* LPUART7 is ttyS8 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS8_DEV           g_lpuart8priv /* LPUART8 is ttyS8 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS8_DEV           g_lpuart9priv /* LPUART9 is ttyS8 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS8_DEV           g_lpuart10priv /* LPUART10 is ttyS8 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS8_DEV           g_lpuart11priv /* LPUART11 is ttyS8 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS8_DEV           g_lpuart12priv /* LPUART12 is ttyS8 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS8_DEV           g_lpuart13priv /* LPUART13 is ttyS8 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS8_DEV           g_lpuart14priv /* LPUART14 is ttyS8 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS8_DEV           g_lpuart15priv /* LPUART15 is ttyS8 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys9.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS9_DEV           g_lpuart0priv /* LPUART0 is ttyS9 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS9_DEV           g_lpuart1priv /* LPUART1 is ttyS9 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS9_DEV           g_lpuart2priv /* LPUART2 is ttyS9 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS9_DEV           g_lpuart3priv /* LPUART3 is ttyS9 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS9_DEV           g_lpuart4priv /* LPUART4 is ttyS9 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS9_DEV           g_lpuart5priv /* LPUART5 is ttyS9 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS9_DEV           g_lpuart6priv /* LPUART6 is ttyS9 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS9_DEV           g_lpuart7priv /* LPUART7 is ttyS9 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS9_DEV           g_lpuart8priv /* LPUART8 is ttyS9 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS9_DEV           g_lpuart9priv /* LPUART9 is ttyS9 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS9_DEV           g_lpuart10priv /* LPUART10 is ttyS9 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS9_DEV           g_lpuart11priv /* LPUART11 is ttyS9 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS9_DEV           g_lpuart12priv /* LPUART12 is ttyS9 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS9_DEV           g_lpuart13priv /* LPUART13 is ttyS9 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS9_DEV           g_lpuart14priv /* LPUART14 is ttyS9 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS9_DEV           g_lpuart15priv /* LPUART15 is ttyS9 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys10.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS10_DEV          g_lpuart0priv /* LPUART0 is ttyS10 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS10_DEV          g_lpuart1priv /* LPUART1 is ttyS10 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS10_DEV          g_lpuart2priv /* LPUART2 is ttyS10 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS10_DEV          g_lpuart3priv /* LPUART3 is ttyS10 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS10_DEV          g_lpuart4priv /* LPUART4 is ttyS10 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS10_DEV          g_lpuart5priv /* LPUART5 is ttyS10 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS10_DEV          g_lpuart6priv /* LPUART6 is ttyS10 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS10_DEV          g_lpuart7priv /* LPUART7 is ttyS10 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS10_DEV          g_lpuart8priv /* LPUART8 is ttyS10 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS10_DEV          g_lpuart9priv /* LPUART9 is ttyS10 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS10_DEV          g_lpuart10priv /* LPUART10 is ttyS10 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS10_DEV          g_lpuart11priv /* LPUART11 is ttyS10 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS10_DEV          g_lpuart12priv /* LPUART12 is ttyS10 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS10_DEV          g_lpuart13priv /* LPUART13 is ttyS10 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS10_DEV          g_lpuart14priv /* LPUART14 is ttyS10 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS10_DEV          g_lpuart15priv /* LPUART15 is ttyS10 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys11.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS11_DEV          g_lpuart0priv /* LPUART0 is ttyS11 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS11_DEV          g_lpuart1priv /* LPUART1 is ttyS11 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS11_DEV          g_lpuart2priv /* LPUART2 is ttyS11 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS11_DEV          g_lpuart3priv /* LPUART3 is ttyS11 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS11_DEV          g_lpuart4priv /* LPUART4 is ttyS11 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS11_DEV          g_lpuart5priv /* LPUART5 is ttyS11 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS11_DEV          g_lpuart6priv /* LPUART6 is ttyS11 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS11_DEV          g_lpuart7priv /* LPUART7 is ttyS11 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS11_DEV          g_lpuart8priv /* LPUART8 is ttyS11 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS11_DEV          g_lpuart9priv /* LPUART9 is ttyS11 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS11_DEV          g_lpuart10priv /* LPUART10 is ttyS11 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS11_DEV          g_lpuart11priv /* LPUART11 is ttyS11 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS11_DEV          g_lpuart12priv /* LPUART12 is ttyS11 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS11_DEV          g_lpuart13priv /* LPUART13 is ttyS11 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS11_DEV          g_lpuart14priv /* LPUART14 is ttyS11 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS11_DEV          g_lpuart15priv /* LPUART15 is ttyS11 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys12.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS12_DEV          g_lpuart0priv /* LPUART0 is ttyS12 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS12_DEV          g_lpuart1priv /* LPUART1 is ttyS12 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS12_DEV          g_lpuart2priv /* LPUART2 is ttyS12 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS12_DEV          g_lpuart3priv /* LPUART3 is ttyS12 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS12_DEV          g_lpuart4priv /* LPUART4 is ttyS12 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS12_DEV          g_lpuart5priv /* LPUART5 is ttyS12 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS12_DEV          g_lpuart6priv /* LPUART6 is ttyS12 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS12_DEV          g_lpuart7priv /* LPUART7 is ttyS12 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS12_DEV          g_lpuart8priv /* LPUART8 is ttyS12 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS12_DEV          g_lpuart9priv /* LPUART9 is ttyS12 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS12_DEV          g_lpuart10priv /* LPUART10 is ttyS12 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS12_DEV          g_lpuart11priv /* LPUART11 is ttyS12 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS12_DEV          g_lpuart12priv /* LPUART12 is ttyS12 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS12_DEV          g_lpuart13priv /* LPUART13 is ttyS12 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS12_DEV          g_lpuart14priv /* LPUART14 is ttyS12 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS12_DEV          g_lpuart15priv /* LPUART15 is ttyS12 */
#  define LPUART15_ASSIGNED   1
#endif

