apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
/* Pick ttys13.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS13_DEV          g_lpuart0priv /* LPUART0 is ttyS13 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS13_DEV          g_lpuart1priv /* LPUART1 is ttyS13 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS13_DEV          g_lpuart2priv /* LPUART2 is ttyS13 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS13_DEV          g_lpuart3priv /* LPUART3 is ttyS13 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS13_DEV          g_lpuart4priv /* LPUART4 is ttyS13 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS13_DEV          g_lpuart5priv /* LPUART5 is ttyS13 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS13_DEV          g_lpuart6priv /* LPUART6 is ttyS13 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS13_DEV          g_lpuart7priv /* LPUART7 is ttyS13 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS13_DEV          g_lpuart8priv /* LPUART8 is ttyS13 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS13_DEV          g_lpuart9priv /* LPUART9 is ttyS13 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS13_DEV          g_lpuart10priv /* LPUART10 is ttyS13 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS13_DEV          g_lpuart11priv /* LPUART11 is ttyS13 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS13_DEV          g_lpuart12priv /* LPUART12 is ttyS13 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS13_DEV          g_lpuart13priv /* LPUART13 is ttyS13 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS13_DEV          g_lpuart14priv /* LPUART14 is ttyS13 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS13_DEV          g_lpuart15priv /* LPUART15 is ttyS13 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys14.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS14_DEV          g_lpuart0priv /* LPUART0 is ttyS14 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS14_DEV          g_lpuart1priv /* LPUART1 is ttyS14 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS14_DEV          g_lpuart2priv /* LPUART2 is ttyS14 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS14_DEV          g_lpuart3priv /* LPUART3 is ttyS14 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS14_DEV          g_lpuart4priv /* LPUART4 is ttyS14 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS14_DEV          g_lpuart5priv /* LPUART5 is ttyS14 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS14_DEV          g_lpuart6priv /* LPUART6 is ttyS14 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS14_DEV          g_lpuart7priv /* LPUART7 is ttyS14 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS14_DEV          g_lpuart8priv /* LPUART8 is ttyS14 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS14_DEV          g_lpuart9priv /* LPUART9 is ttyS14 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS14_DEV          g_lpuart10priv /* LPUART10 is ttyS14 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS14_DEV          g_lpuart11priv /* LPUART11 is ttyS14 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS14_DEV          g_lpuart12priv /* LPUART12 is ttyS14 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS14_DEV          g_lpuart13priv /* LPUART13 is ttyS14 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS14_DEV          g_lpuart14priv /* LPUART14 is ttyS14 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS14_DEV          g_lpuart15priv /* LPUART15 is ttyS14 */
#  define LPUART15_ASSIGNED   1
#endif

/* Pick ttys15.
 * One of LPUART0-15 could be the console;
 */

#if defined(CONFIG_S32K3XX_LPUART0) && !defined(LPUART0_ASSIGNED)
#  define TTYS15_DEV          g_lpuart0priv /* LPUART0 is ttyS15 */
#  define LPUART0_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART1) && !defined(LPUART1_ASSIGNED)
#  define TTYS15_DEV          g_lpuart1priv /* LPUART1 is ttyS15 */
#  define LPUART1_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART2) && !defined(LPUART2_ASSIGNED)
#  define TTYS15_DEV          g_lpuart2priv /* LPUART2 is ttyS15 */
#  define LPUART2_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART3) && !defined(LPUART3_ASSIGNED)
#  define TTYS15_DEV          g_lpuart3priv /* LPUART3 is ttyS15 */
#  define LPUART3_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART4) && !defined(LPUART4_ASSIGNED)
#  define TTYS15_DEV          g_lpuart4priv /* LPUART4 is ttyS15 */
#  define LPUART4_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART5) && !defined(LPUART5_ASSIGNED)
#  define TTYS15_DEV          g_lpuart5priv /* LPUART5 is ttyS15 */
#  define LPUART5_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART6) && !defined(LPUART6_ASSIGNED)
#  define TTYS15_DEV          g_lpuart6priv /* LPUART6 is ttyS15 */
#  define LPUART6_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART7) && !defined(LPUART7_ASSIGNED)
#  define TTYS15_DEV          g_lpuart7priv /* LPUART7 is ttyS15 */
#  define LPUART7_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART8) && !defined(LPUART8_ASSIGNED)
#  define TTYS15_DEV          g_lpuart8priv /* LPUART8 is ttyS15 */
#  define LPUART8_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART9) && !defined(LPUART9_ASSIGNED)
#  define TTYS15_DEV          g_lpuart9priv /* LPUART9 is ttyS15 */
#  define LPUART9_ASSIGNED    1
#elif defined(CONFIG_S32K3XX_LPUART10) && !defined(LPUART10_ASSIGNED)
#  define TTYS15_DEV          g_lpuart10priv /* LPUART10 is ttyS15 */
#  define LPUART10_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART11) && !defined(LPUART11_ASSIGNED)
#  define TTYS15_DEV          g_lpuart11priv /* LPUART11 is ttyS15 */
#  define LPUART11_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART12) && !defined(LPUART12_ASSIGNED)
#  define TTYS15_DEV          g_lpuart12priv /* LPUART12 is ttyS15 */
#  define LPUART12_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART13) && !defined(LPUART13_ASSIGNED)
#  define TTYS15_DEV          g_lpuart13priv /* LPUART13 is ttyS15 */
#  define LPUART13_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART14) && !defined(LPUART14_ASSIGNED)
#  define TTYS15_DEV          g_lpuart14priv /* LPUART14 is ttyS15 */
#  define LPUART14_ASSIGNED   1
#elif defined(CONFIG_S32K3XX_LPUART15) && !defined(LPUART15_ASSIGNED)
#  define TTYS15_DEV          g_lpuart15priv /* LPUART15 is ttyS15 */
#  define LPUART15_ASSIGNED   1
#endif

/* Power management definitions */

#if defined(CONFIG_PM) && !defined(CONFIG_S32K3XX_PM_SERIAL_ACTIVITY)
#  define CONFIG_S32K3XX_PM_SERIAL_ACTIVITY 10
#endif

