apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#if defined(CONFIG_PM)
#  define PM_IDLE_DOMAIN      0 /* Revisit */
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct s32k3xx_uart_s
{
  struct uart_dev_s dev;    /* Generic UART device */
  uint32_t uartbase;        /* Base address of UART registers */
  uint32_t baud;            /* Configured baud */
  uint32_t ie;              /* Saved enabled interrupts */
  uint8_t  irq;             /* IRQ associated with this UART */
  uint8_t  parity;          /* 0=none, 1=odd, 2=even */
  spinlock_t lock;          /* Spinlock */
  uint8_t  bits;            /* Number of bits (7 or 8) */
#if defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)
  uint8_t  inviflow:1;      /* Invert RTS sense */
  const uint32_t rts_gpio;  /* LPUART RTS GPIO pin configuration */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  const uint32_t cts_gpio;  /* LPUART CTS GPIO pin configuration */
#endif
#ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  const uint32_t tx_gpio;   /* TX GPIO pin configuration */
#endif

  uint8_t  stopbits2:1;     /* 1: Configure with 2 stop bits vs 1 */
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  uint8_t  iflow:1;         /* input flow control (RTS) enabled */
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  uint8_t  oflow:1;         /* output flow control (CTS) enabled */
#endif
#ifdef CONFIG_SERIAL_RS485CONTROL
  uint8_t rs485mode:1;      /* We are in RS485 (RTS on TX) mode */
#endif
  /* TX DMA state */

#ifdef SERIAL_HAVE_TXDMA
  const unsigned int dma_txreqsrc;  /* DMAMUX source of TX DMA request */
  DMACH_HANDLE       txdma;         /* currently-open transmit DMA stream */
#endif

  /* RX DMA state */

#ifdef SERIAL_HAVE_RXDMA
  const unsigned int dma_rxreqsrc;  /* DMAMUX source of RX DMA request */
  DMACH_HANDLE       rxdma;         /* currently-open receive DMA stream */
  bool               rxenable;      /* DMA-based reception en/disable */
  uint32_t           rxdmanext;     /* Next byte in the DMA buffer to be read */
#ifdef CONFIG_ARMV7M_DCACHE
  uint32_t           rxdmaavail;    /* Number of bytes available without need to
                                     * to invalidate the data cache */
#endif
  char *const        rxfifo;        /* Receive DMA buffer */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t s32k3xx_serialin(struct s32k3xx_uart_s *priv,
                                      uint32_t offset);
static inline void s32k3xx_serialout(struct s32k3xx_uart_s *priv,
                                   uint32_t offset, uint32_t value);
static inline void s32k3xx_disableuartint(struct s32k3xx_uart_s *priv,
                                        uint32_t *ie);
static inline void s32k3xx_restoreuartint(struct s32k3xx_uart_s *priv,
                                        uint32_t ie);

static int  s32k3xx_setup(struct uart_dev_s *dev);
static void s32k3xx_shutdown(struct uart_dev_s *dev);
static int  s32k3xx_attach(struct uart_dev_s *dev);
static void s32k3xx_detach(struct uart_dev_s *dev);
static int  s32k3xx_interrupt(int irq, void *context, void *arg);
static int  s32k3xx_ioctl(struct file *filep, int cmd, unsigned long arg);
#if !defined(SERIAL_HAVE_ONLY_RXDMA)
static int  s32k3xx_receive(struct uart_dev_s *dev, unsigned int *status);
static void s32k3xx_rxint(struct uart_dev_s *dev, bool enable);
static bool s32k3xx_rxavailable(struct uart_dev_s *dev);
#endif
#if !defined(SERIAL_HAVE_ONLY_TXDMA)
static void s32k3xx_txint(struct uart_dev_s *dev, bool enable);
#endif

#ifdef CONFIG_SERIAL_IFLOWCONTROL
static bool s32k3xx_rxflowcontrol(struct uart_dev_s *dev,
                                  unsigned int nbuffered, bool upper);
#endif
static void s32k3xx_send(struct uart_dev_s *dev, int ch);

static bool s32k3xx_txready(struct uart_dev_s *dev);

#ifdef SERIAL_HAVE_TXDMA
static void s32k3xx_dma_send(struct uart_dev_s *dev);
static void s32k3xx_dma_txint(struct uart_dev_s *dev, bool enable);
static void s32k3xx_dma_txavailable(struct uart_dev_s *dev);
static void s32k3xx_dma_txcallback(DMACH_HANDLE handle, void *arg, bool done,
                                   int result);
#endif

#if defined(SERIAL_HAVE_RXDMA) || defined(SERIAL_HAVE_TXDMA)
static int  s32k3xx_dma_setup(struct uart_dev_s *dev);
static void s32k3xx_dma_shutdown(struct uart_dev_s *dev);
#endif

#ifdef SERIAL_HAVE_RXDMA
static int  s32k3xx_dma_receive(struct uart_dev_s *dev,
                                unsigned int *status);
#ifdef CONFIG_PM
static void s32k3xx_dma_reenable(struct s32k3xx_uart_s *priv);
#endif
static void s32k3xx_dma_rxint(struct uart_dev_s *dev, bool enable);
static bool s32k3xx_dma_rxavailable(struct uart_dev_s *dev);

static void s32k3xx_dma_rxcallback(DMACH_HANDLE handle, void *arg, bool done,
                                   int result);
#endif

static bool s32k3xx_txempty(struct uart_dev_s *dev);

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int dowmin,
                         enum pm_state_e pmstate);
static int  up_pm_prepare(struct pm_callback_s *cb, int domain,
                          enum pm_state_e pmstate);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Serial driver UART operations */

#if !defined(SERIAL_HAVE_ONLY_TXDMA) && !defined(SERIAL_HAVE_ONLY_RXDMA)
static const struct uart_ops_s g_lpuart_ops =
{
  .setup          = s32k3xx_setup,
  .shutdown       = s32k3xx_shutdown,
  .attach         = s32k3xx_attach,
  .detach         = s32k3xx_detach,
  .ioctl          = s32k3xx_ioctl,
  .receive        = s32k3xx_receive,
  .rxint          = s32k3xx_rxint,
  .rxavailable    = s32k3xx_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = s32k3xx_rxflowcontrol,
#endif
  .send           = s32k3xx_send,
  .txint          = s32k3xx_txint,
  .txready        = s32k3xx_txready,
  .txempty        = s32k3xx_txempty,
};
#endif

#if defined(SERIAL_HAVE_RXDMA) && defined(SERIAL_HAVE_TXDMA)
static const struct uart_ops_s g_lpuart_rxtxdma_ops =
{
  .setup          = s32k3xx_dma_setup,
  .shutdown       = s32k3xx_dma_shutdown,
  .attach         = s32k3xx_attach,
  .detach         = s32k3xx_detach,
  .ioctl          = s32k3xx_ioctl,
  .receive        = s32k3xx_dma_receive,
  .rxint          = s32k3xx_dma_rxint,
  .rxavailable    = s32k3xx_dma_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = s32k3xx_rxflowcontrol,
#endif
  .send           = s32k3xx_send,
  .txint          = s32k3xx_dma_txint,
  .txready        = s32k3xx_txready,
  .txempty        = s32k3xx_txempty,
  .dmatxavail     = s32k3xx_dma_txavailable,
  .dmasend        = s32k3xx_dma_send,
};
#endif

