apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#ifdef CONFIG_S32K3XX_LPUART13
static char g_lpuart13rxbuffer[CONFIG_LPUART13_RXBUFSIZE];
static char g_lpuart13txbuffer[LPUART13_TXBUFSIZE_ADJUSTED]
  LPUART13_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_S32K3XX_LPUART14
static char g_lpuart14rxbuffer[CONFIG_LPUART14_RXBUFSIZE];
static char g_lpuart14txbuffer[LPUART14_TXBUFSIZE_ADJUSTED]
  LPUART14_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_S32K3XX_LPUART15
static char g_lpuart15rxbuffer[CONFIG_LPUART15_RXBUFSIZE];
static char g_lpuart15txbuffer[LPUART15_TXBUFSIZE_ADJUSTED]
  LPUART15_TXBUFSIZE_ALGN;
#endif

#ifdef CONFIG_S32K3XX_LPUART0
static struct s32k3xx_uart_s g_lpuart0priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART0_RXBUFSIZE,
        .buffer     = g_lpuart0rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART0_TXBUFSIZE,
        .buffer     = g_lpuart0txbuffer,
      },
    #if defined(CONFIG_LPUART0_RXDMA) && defined(CONFIG_LPUART0_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
    #elif defined(CONFIG_LPUART0_RXDMA) && !defined(CONFIG_LPUART0_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
    #elif !defined(CONFIG_LPUART0_RXDMA) && defined(CONFIG_LPUART0_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
    #else
        .ops       = &g_lpuart_ops,
    #endif
      .priv         = &g_lpuart0priv,
    },

  .uartbase     = S32K3XX_LPUART0_BASE,
  .baud         = CONFIG_LPUART0_BAUD,
  .irq          = S32K3XX_IRQ_LPUART0,
  .parity       = CONFIG_LPUART0_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART0_BITS,
  .stopbits2    = CONFIG_LPUART0_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART0_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART0_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART0_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART0_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART0_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART0_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART0_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART0_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART0_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART0_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART08_TX,
#  endif
#  ifdef CONFIG_LPUART0_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART08_RX,
  .rxfifo        = g_lpuart0rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART1
static struct s32k3xx_uart_s g_lpuart1priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART1_RXBUFSIZE,
        .buffer     = g_lpuart1rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART1_TXBUFSIZE,
        .buffer     = g_lpuart1txbuffer,
      },
#  if defined(CONFIG_LPUART1_RXDMA) && defined(CONFIG_LPUART1_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART1_RXDMA) && !defined(CONFIG_LPUART1_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART1_RXDMA) && defined(CONFIG_LPUART1_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart1priv,
    },

  .uartbase     = S32K3XX_LPUART1_BASE,
  .baud         = CONFIG_LPUART1_BAUD,
  .irq          = S32K3XX_IRQ_LPUART1,
  .parity       = CONFIG_LPUART1_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART1_BITS,
  .stopbits2    = CONFIG_LPUART1_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART1_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART1_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART1_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART1_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART1_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART1_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART1_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART1_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART1_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART1_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART19_TX,
#  endif
#  ifdef CONFIG_LPUART1_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART19_RX,
  .rxfifo        = g_lpuart1rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART2
static struct s32k3xx_uart_s g_lpuart2priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART2_RXBUFSIZE,
        .buffer     = g_lpuart2rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART2_TXBUFSIZE,
        .buffer     = g_lpuart2txbuffer,
      },
#  if defined(CONFIG_LPUART2_RXDMA) && defined(CONFIG_LPUART2_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART2_RXDMA) && !defined(CONFIG_LPUART2_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART2_RXDMA) && defined(CONFIG_LPUART2_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart2priv,
    },

  .uartbase     = S32K3XX_LPUART2_BASE,
  .baud         = CONFIG_LPUART2_BAUD,
  .irq          = S32K3XX_IRQ_LPUART2,
  .parity       = CONFIG_LPUART2_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART2_BITS,
  .stopbits2    = CONFIG_LPUART2_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART2_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART2_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART2_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART2_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART2_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART2_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART2_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART2_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

