apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART2_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART2_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART210_TX,
#  endif
#  ifdef CONFIG_LPUART2_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART210_RX,
  .rxfifo        = g_lpuart2rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART3
static struct s32k3xx_uart_s g_lpuart3priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART3_RXBUFSIZE,
        .buffer     = g_lpuart3rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART3_TXBUFSIZE,
        .buffer     = g_lpuart3txbuffer,
      },
#  if defined(CONFIG_LPUART3_RXDMA) && defined(CONFIG_LPUART3_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART3_RXDMA) && !defined(CONFIG_LPUART3_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART3_RXDMA) && defined(CONFIG_LPUART3_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart3priv,
    },

  .uartbase     = S32K3XX_LPUART3_BASE,
  .baud         = CONFIG_LPUART3_BAUD,
  .irq          = S32K3XX_IRQ_LPUART3,
  .parity       = CONFIG_LPUART3_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART3_BITS,
  .stopbits2    = CONFIG_LPUART3_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART3_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART3_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART3_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART3_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART3_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART3_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART3_TX,
  #endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART3_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART3_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART3_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART311_TX,
#  endif
#  ifdef CONFIG_LPUART3_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART311_RX,
  .rxfifo        = g_lpuart3rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART4
static struct s32k3xx_uart_s g_lpuart4priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART4_RXBUFSIZE,
        .buffer     = g_lpuart4rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART4_TXBUFSIZE,
        .buffer     = g_lpuart4txbuffer,
      },
#  if defined(CONFIG_LPUART4_RXDMA) && defined(CONFIG_LPUART4_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART4_RXDMA) && !defined(CONFIG_LPUART4_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART4_RXDMA) && defined(CONFIG_LPUART4_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart4priv,
    },

  .uartbase     = S32K3XX_LPUART4_BASE,
  .baud         = CONFIG_LPUART4_BAUD,
  .irq          = S32K3XX_IRQ_LPUART4,
  .parity       = CONFIG_LPUART4_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART4_BITS,
  .stopbits2    = CONFIG_LPUART4_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART4_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART4_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART4_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART4_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART4_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART4_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART4_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART4_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART4_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART4_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART412_TX,
#  endif
#  ifdef CONFIG_LPUART4_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART412_RX,
  .rxfifo        = g_lpuart4rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART5
static struct s32k3xx_uart_s g_lpuart5priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART5_RXBUFSIZE,
        .buffer     = g_lpuart5rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART5_TXBUFSIZE,
        .buffer     = g_lpuart5txbuffer,
      },
#  if defined(CONFIG_LPUART5_RXDMA) && defined(CONFIG_LPUART5_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART5_RXDMA) && !defined(CONFIG_LPUART5_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART5_RXDMA) && defined(CONFIG_LPUART5_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart5priv,
    },

  .uartbase     = S32K3XX_LPUART5_BASE,
  .baud         = CONFIG_LPUART5_BAUD,
  .irq          = S32K3XX_IRQ_LPUART5,
  .parity       = CONFIG_LPUART5_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART5_BITS,
  .stopbits2    = CONFIG_LPUART5_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART5_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART5_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART5_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART5_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART5_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART5_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART5_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART5_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

