apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART5_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART5_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART513_TX,
#  endif
#  ifdef CONFIG_LPUART5_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART513_RX,
  .rxfifo        = g_lpuart5rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART6
static struct s32k3xx_uart_s g_lpuart6priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART6_RXBUFSIZE,
        .buffer     = g_lpuart6rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART6_TXBUFSIZE,
        .buffer     = g_lpuart6txbuffer,
      },
#  if defined(CONFIG_LPUART6_RXDMA) && defined(CONFIG_LPUART6_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART6_RXDMA) && !defined(CONFIG_LPUART6_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART6_RXDMA) && defined(CONFIG_LPUART6_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart6priv,
    },

  .uartbase     = S32K3XX_LPUART6_BASE,
  .baud         = CONFIG_LPUART6_BAUD,
  .irq          = S32K3XX_IRQ_LPUART6,
  .parity       = CONFIG_LPUART6_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART6_BITS,
  .stopbits2    = CONFIG_LPUART6_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART6_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART6_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART6_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART6_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART6_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART6_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART6_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART6_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART6_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART6_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART614_TX,
#  endif
#  ifdef CONFIG_LPUART6_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART614_RX,
  .rxfifo        = g_lpuart6rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART7
static struct s32k3xx_uart_s g_lpuart7priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART7_RXBUFSIZE,
        .buffer     = g_lpuart7rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART7_TXBUFSIZE,
        .buffer     = g_lpuart7txbuffer,
      },
#  if defined(CONFIG_LPUART7_RXDMA) && defined(CONFIG_LPUART7_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART7_RXDMA) && !defined(CONFIG_LPUART7_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART7_RXDMA) && defined(CONFIG_LPUART7_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart7priv,
    },

  .uartbase     = S32K3XX_LPUART7_BASE,
  .baud         = CONFIG_LPUART7_BAUD,
  .irq          = S32K3XX_IRQ_LPUART7,
  .parity       = CONFIG_LPUART7_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART7_BITS,
  .stopbits2    = CONFIG_LPUART7_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART7_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART7_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART7_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART7_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART7_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART7_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART7_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART7_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART7_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART7_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART715_TX,
#  endif
#  ifdef CONFIG_LPUART7_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART715_RX,
  .rxfifo        = g_lpuart7rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART8
static struct s32k3xx_uart_s g_lpuart8priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART8_RXBUFSIZE,
        .buffer     = g_lpuart8rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART8_TXBUFSIZE,
        .buffer     = g_lpuart8txbuffer,
      },
#  if defined(CONFIG_LPUART8_RXDMA) && defined(CONFIG_LPUART8_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART8_RXDMA) && !defined(CONFIG_LPUART8_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART8_RXDMA) && defined(CONFIG_LPUART8_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart8priv,
    },

  .uartbase     = S32K3XX_LPUART8_BASE,
  .baud         = CONFIG_LPUART8_BAUD,
  .irq          = S32K3XX_IRQ_LPUART8,
  .parity       = CONFIG_LPUART8_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART8_BITS,
  .stopbits2    = CONFIG_LPUART8_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART8_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART8_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART8_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART8_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART8_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART8_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART8_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART8_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART8_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART8_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART08_TX,
#  endif
#  ifdef CONFIG_LPUART8_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART08_RX,
  .rxfifo        = g_lpuart8rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART9
static struct s32k3xx_uart_s g_lpuart9priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART9_RXBUFSIZE,
        .buffer     = g_lpuart9rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART9_TXBUFSIZE,
        .buffer     = g_lpuart9txbuffer,
      },
#  if defined(CONFIG_LPUART9_RXDMA) && defined(CONFIG_LPUART9_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART9_RXDMA) && !defined(CONFIG_LPUART9_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART9_RXDMA) && defined(CONFIG_LPUART9_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart9priv,
    },

  .uartbase     = S32K3XX_LPUART9_BASE,
  .baud         = CONFIG_LPUART9_BAUD,
  .irq          = S32K3XX_IRQ_LPUART9,
  .parity       = CONFIG_LPUART9_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART9_BITS,
  .stopbits2    = CONFIG_LPUART9_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART9_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART9_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART9_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART9_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART9_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART9_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART9_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART9_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART9_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART9_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART19_TX,
#  endif
#  ifdef CONFIG_LPUART9_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART19_RX,
  .rxfifo        = g_lpuart9rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART10
static struct s32k3xx_uart_s g_lpuart10priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART10_RXBUFSIZE,
        .buffer     = g_lpuart10rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART10_TXBUFSIZE,
        .buffer     = g_lpuart10txbuffer,
      },
#  if defined(CONFIG_LPUART10_RXDMA) && defined(CONFIG_LPUART10_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART10_RXDMA) && !defined(CONFIG_LPUART10_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART10_RXDMA) && defined(CONFIG_LPUART10_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart10priv,
    },

  .uartbase     = S32K3XX_LPUART10_BASE,
  .baud         = CONFIG_LPUART10_BAUD,
  .irq          = S32K3XX_IRQ_LPUART10,
  .parity       = CONFIG_LPUART10_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART10_BITS,
  .stopbits2    = CONFIG_LPUART10_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART10_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART10_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART10_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART10_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART10_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART10_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART10_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART10_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART10_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

