apache/nuttx/arch/arm/src/s32k3xx/s32k3xx_serial.c
#  ifdef CONFIG_LPUART10_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART210_TX,
#  endif
#  ifdef CONFIG_LPUART10_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART210_RX,
  .rxfifo        = g_lpuart10rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART11
static struct s32k3xx_uart_s g_lpuart11priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART11_RXBUFSIZE,
        .buffer     = g_lpuart11rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART11_TXBUFSIZE,
        .buffer     = g_lpuart11txbuffer,
      },
#  if defined(CONFIG_LPUART11_RXDMA) && defined(CONFIG_LPUART11_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART11_RXDMA) && !defined(CONFIG_LPUART11_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART11_RXDMA) && defined(CONFIG_LPUART11_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart11priv,
    },

  .uartbase     = S32K3XX_LPUART11_BASE,
  .baud         = CONFIG_LPUART11_BAUD,
  .irq          = S32K3XX_IRQ_LPUART11,
  .parity       = CONFIG_LPUART11_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART11_BITS,
  .stopbits2    = CONFIG_LPUART11_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART11_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART11_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART11_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART11_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART11_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART11_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART11_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART11_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART11_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART11_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART311_TX,
#  endif
#  ifdef CONFIG_LPUART11_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART311_RX,
  .rxfifo        = g_lpuart11rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART12
static struct s32k3xx_uart_s g_lpuart12priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART12_RXBUFSIZE,
        .buffer     = g_lpuart12rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART12_TXBUFSIZE,
        .buffer     = g_lpuart12txbuffer,
      },
#  if defined(CONFIG_LPUART12_RXDMA) && defined(CONFIG_LPUART12_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART12_RXDMA) && !defined(CONFIG_LPUART12_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART12_RXDMA) && defined(CONFIG_LPUART12_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart12priv,
    },

  .uartbase     = S32K3XX_LPUART12_BASE,
  .baud         = CONFIG_LPUART12_BAUD,
  .irq          = S32K3XX_IRQ_LPUART12,
  .parity       = CONFIG_LPUART12_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART12_BITS,
  .stopbits2    = CONFIG_LPUART12_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART12_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART12_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART12_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART12_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART12_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART12_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART12_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART12_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART12_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART12_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART412_TX,
#  endif
#  ifdef CONFIG_LPUART12_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART412_RX,
  .rxfifo        = g_lpuart12rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART13
static struct s32k3xx_uart_s g_lpuart13priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART13_RXBUFSIZE,
        .buffer     = g_lpuart13rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART13_TXBUFSIZE,
        .buffer     = g_lpuart13txbuffer,
      },
#  if defined(CONFIG_LPUART13_RXDMA) && defined(CONFIG_LPUART13_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART13_RXDMA) && !defined(CONFIG_LPUART13_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART13_RXDMA) && defined(CONFIG_LPUART13_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart13priv,
    },

  .uartbase     = S32K3XX_LPUART13_BASE,
  .baud         = CONFIG_LPUART13_BAUD,
  .irq          = S32K3XX_IRQ_LPUART13,
  .parity       = CONFIG_LPUART13_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART13_BITS,
  .stopbits2    = CONFIG_LPUART13_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART13_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART13_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART13_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART13_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART13_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART13_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART13_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART13_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART13_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART13_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART513_TX,
#  endif
#  ifdef CONFIG_LPUART13_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART513_RX,
  .rxfifo        = g_lpuart13rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART14
static struct s32k3xx_uart_s g_lpuart14priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART14_RXBUFSIZE,
        .buffer     = g_lpuart14rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART14_TXBUFSIZE,
        .buffer     = g_lpuart14txbuffer,
      },
#  if defined(CONFIG_LPUART14_RXDMA) && defined(CONFIG_LPUART14_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART14_RXDMA) && !defined(CONFIG_LPUART14_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART14_RXDMA) && defined(CONFIG_LPUART14_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart14priv,
    },

  .uartbase     = S32K3XX_LPUART14_BASE,
  .baud         = CONFIG_LPUART14_BAUD,
  .irq          = S32K3XX_IRQ_LPUART14,
  .parity       = CONFIG_LPUART14_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART14_BITS,
  .stopbits2    = CONFIG_LPUART14_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART14_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART14_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART14_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART14_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART14_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART14_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART14_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART14_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART14_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART14_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART614_TX,
#  endif
#  ifdef CONFIG_LPUART14_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART614_RX,
  .rxfifo        = g_lpuart14rxfifo,
#  endif
};
#endif

#ifdef CONFIG_S32K3XX_LPUART15
static struct s32k3xx_uart_s g_lpuart15priv =
{
  .dev =
    {
      .recv         =
      {
        .size       = CONFIG_LPUART15_RXBUFSIZE,
        .buffer     = g_lpuart15rxbuffer,
      },
      .xmit         =
      {
        .size       = CONFIG_LPUART15_TXBUFSIZE,
        .buffer     = g_lpuart15txbuffer,
      },
#  if defined(CONFIG_LPUART15_RXDMA) && defined(CONFIG_LPUART15_TXDMA)
        .ops       = &g_lpuart_rxtxdma_ops,
#  elif defined(CONFIG_LPUART15_RXDMA) && !defined(CONFIG_LPUART15_TXDMA)
        .ops       = &g_lpuart_rxdma_ops,
#  elif !defined(CONFIG_LPUART15_RXDMA) && defined(CONFIG_LPUART15_TXDMA)
        .ops       = &g_lpuart_txdma_ops,
#  else
        .ops       = &g_lpuart_ops,
#  endif
      .priv         = &g_lpuart15priv,
    },

  .uartbase     = S32K3XX_LPUART15_BASE,
  .baud         = CONFIG_LPUART15_BAUD,
  .irq          = S32K3XX_IRQ_LPUART15,
  .parity       = CONFIG_LPUART15_PARITY,
  .lock         = SP_UNLOCKED,
  .bits         = CONFIG_LPUART15_BITS,
  .stopbits2    = CONFIG_LPUART15_2STOP,
#  if defined(CONFIG_SERIAL_OFLOWCONTROL) && defined(CONFIG_LPUART15_OFLOWCONTROL)
  .oflow        = 1,
  .cts_gpio     = PIN_LPUART15_CTS,
#  endif
#  if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART15_IFLOWCONTROL)
  .iflow        = 1,
#  endif
#  if ((defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART15_RS485RTSCONTROL)) || \
      (defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_LPUART15_IFLOWCONTROL)))
  .rts_gpio     = PIN_LPUART15_RTS,
#  endif
#  ifdef CONFIG_S32K3XX_LPUART_SINGLEWIRE
  .tx_gpio      = PIN_LPUART15_TX,
#  endif

#  if (defined(CONFIG_SERIAL_RS485CONTROL) || defined(CONFIG_SERIAL_IFLOWCONTROL)) && \
      defined(CONFIG_LPUART15_INVERTIFLOWCONTROL)
  .inviflow     = 1,
#  endif

#  if defined(CONFIG_SERIAL_RS485CONTROL) && defined(CONFIG_LPUART15_RS485RTSCONTROL)
  .rs485mode    = 1,
#  endif

#  ifdef CONFIG_LPUART15_TXDMA
  .dma_txreqsrc = DMA_REQ_LPUART715_TX,
#  endif
#  ifdef CONFIG_LPUART15_RXDMA
  .dma_rxreqsrc = DMA_REQ_LPUART715_RX,
  .rxfifo        = g_lpuart15rxfifo,
#  endif
};
#endif

